app/controllers/cocktails_controller.rb

  def index
    if params["search"]
      @filter = params["search"]["categories"].concat(params["search"]["flavors"]).flatten.reject(&:blank?)
      @name = params["search"]["names"]
      if @filter.empty?
        @coktails = Cocktail.all.where("name ILIKE ?", "%#{@name}%")
      elsif params["search"]["names"].nil?
        @cocktails = Cocktail.all.tagged_with(@filter, any: true)
---
SELECT "cocktails".* FROM "cocktails"